custom_models/cyl_test/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       49327;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          344;
        startFace       49407;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          378;
        startFace       49751;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       50129;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          49788;
        startFace       50249;
    }
)

// ************************************************************************* //
